01Hub/fbedit/STM32F4Discovery/STM32F4_Scope/Scope/main.c
          while (USART_GetFlagStatus(USART2, USART_FLAG_TXE) == RESET);
          USART_SendData(USART2, (uint8_t)65);
          while (USART_GetFlagStatus(USART2, USART_FLAG_TXE) == RESET);
          USART_SendData(USART2, (uint8_t)66);
          STM32_DataStruct.CommandStruct.Command = STM32_CommandDone;
        break;
      }
    }
    i=0;
    while (i < 1000000)
    {
      i++;
    }
    ADC_SoftwareStartInjectedConv(ADC3);
  }
}

/*******************************************************************************
* Function Name  : WaitForTrigger
* Description    : This function waits for a trigger on CHA, CHB or
*                  logic analyser .
* Input          : None
* Output         : None
* Return         : None
*******************************************************************************/
void WaitForTrigger(void)
{
  uint32_t tmp;
  /* Syncronize with rising or falling edge or logic analyser */
  switch (STM32_DataStruct.CommandStruct.TriggerMode)
  {
    case (STM32_TriggerRisingCHA):
      /* Count on rising edge */
      TIM2->CCER = 0x0000;
      /* Wait until TIM2 increments */
      tmp = TIM2->CNT;
      while (tmp == TIM2->CNT)
      {
        if (STM32_DataStruct.CommandStruct.TriggerWait == 0)
        {
          break;
        }
      }
      break;
    case (STM32_TriggerFallingCHA):
      /* Count on falling edge */
      TIM2->CCER = 0x0020;
      /* Wait until TIM2 increments */
      tmp = TIM2->CNT;
      while (tmp == TIM2->CNT)
      {
        if (STM32_DataStruct.CommandStruct.TriggerWait == 0)
        {
          break;
        }
      }
      break;
    case (STM32_TriggerRisingCHB):
      /* Count on rising edge */
      TIM5->CCER = 0x0000;
      /* Wait until TIM5 increments */
      tmp = TIM5->CNT;
      while (tmp == TIM5->CNT)
      {
        if (STM32_DataStruct.CommandStruct.TriggerWait == 0)
        {
          break;
        }
      }
      break;
    case (STM32_TriggerFallingCHB):
      /* Count on falling edge */
      TIM5->CCER = 0x0002;
      /* Wait until TIM5 increments */
      tmp = TIM5->CNT;
      while (tmp == TIM5->CNT)
      {
        if (STM32_DataStruct.CommandStruct.TriggerWait == 0)
        {
          break;
        }
      }
      break;
    case (STM32_TriggerLGA):
      tmp = STM32_DataStruct.CommandStruct.TriggerValue & STM32_DataStruct.CommandStruct.TriggerMask;
      /* Wait until conditions are met */
      while ((((GPIOE->IDR>>8) & STM32_DataStruct.CommandStruct.TriggerMask) != tmp))
      {
        if (STM32_DataStruct.CommandStruct.TriggerWait == 0)
        {
          break;
        }
      }
      break;
    case (STM32_TriggerLGAEdge):
      tmp = STM32_DataStruct.CommandStruct.TriggerValue & STM32_DataStruct.CommandStruct.TriggerMask;
      /* Edge sensitive */
      /* Wait while conditions are met */
      while ((((GPIOE->IDR>>8) & STM32_DataStruct.CommandStruct.TriggerMask) == tmp))
      {
        if (STM32_DataStruct.CommandStruct.TriggerWait == 0)
        {
          break;
        }
      }
      /* Wait until conditions are met */
      while ((((GPIOE->IDR>>8) & STM32_DataStruct.CommandStruct.TriggerMask) != tmp))
      {
        if (STM32_DataStruct.CommandStruct.TriggerWait == 0)
        {
          break;
        }
      }
      break;
    default:
      break;
  }
}

void RCC_Config(void)
{
  /* Enable DMA2, GPIOA, GPIOB, GPIOC and GPIOE clocks ****************************************/
  RCC_AHB1PeriphClockCmd(RCC_AHB1Periph_DMA2 | RCC_AHB1Periph_GPIOA | RCC_AHB1Periph_GPIOB | RCC_AHB1Periph_GPIOC | RCC_AHB1Periph_GPIOE, ENABLE);
  /* Enable USART2, TIM2, TIM3, TIM4 and TIM5 clocks ****************************************/
  RCC_APB1PeriphClockCmd(RCC_APB1Periph_USART2 | RCC_APB1Periph_TIM2 | RCC_APB1Periph_TIM3 | RCC_APB1Periph_TIM4 | RCC_APB1Periph_TIM5, ENABLE);
  /* Enable TIM8, TIM10, ADC1, ADC2 and ADC3 clocks ****************************************/
  RCC_APB2PeriphClockCmd(RCC_APB2Periph_TIM8 | RCC_APB2Periph_TIM10 | RCC_APB2Periph_ADC1 | RCC_APB2Periph_ADC2 | RCC_APB2Periph_ADC3, ENABLE);
}

void NVIC_Config(void)
{
  NVIC_InitTypeDef NVIC_InitStructure;

  /* Enable the TIM3 gloabal Interrupt */
  NVIC_InitStructure.NVIC_IRQChannel = TIM3_IRQn;
  NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority = 0;
  NVIC_InitStructure.NVIC_IRQChannelSubPriority = 1;
  NVIC_InitStructure.NVIC_IRQChannelCmd = ENABLE;
  NVIC_Init(&NVIC_InitStructure);
}

void GPIO_Config(void)
{
  GPIO_InitTypeDef        GPIO_InitStructure;

  /* TIM4 chennel 2 and TIM10 channel 1 configuration : PB7, PB8 */
  GPIO_InitStructure.GPIO_Pin   = GPIO_Pin_8 | GPIO_Pin_7;
  GPIO_InitStructure.GPIO_Mode  = GPIO_Mode_AF;
  GPIO_InitStructure.GPIO_Speed = GPIO_Speed_100MHz;
  GPIO_InitStructure.GPIO_OType = GPIO_OType_PP;
  GPIO_InitStructure.GPIO_PuPd  = GPIO_PuPd_UP ;
  GPIO_Init(GPIOB, &GPIO_InitStructure);
  /* Connect TIM4 pin to AF2 */
  GPIO_PinAFConfig(GPIOB, GPIO_PinSource7, GPIO_AF_TIM4);
  /* Connect TIM10 pin to AF2 */
  GPIO_PinAFConfig(GPIOB, GPIO_PinSource8, GPIO_AF_TIM10);

  /* TIM2 chennel 2 and TIM5 channel 1 configuration : PA1, PA0 */
  GPIO_InitStructure.GPIO_Pin   = GPIO_Pin_1 | GPIO_Pin_0;
  GPIO_InitStructure.GPIO_Mode  = GPIO_Mode_AF;
  GPIO_InitStructure.GPIO_Speed = GPIO_Speed_100MHz;
  GPIO_InitStructure.GPIO_OType = GPIO_OType_PP;
  GPIO_InitStructure.GPIO_PuPd  = GPIO_PuPd_NOPULL ;
  GPIO_Init(GPIOA, &GPIO_InitStructure);
  /* Connect TIM2 pin to AF2 */
  GPIO_PinAFConfig(GPIOA, GPIO_PinSource1, GPIO_AF_TIM2);
  /* Connect TIM5 pin to AF2 */
  GPIO_PinAFConfig(GPIOA, GPIO_PinSource0, GPIO_AF_TIM5);

  /* Configure ADC123 Channel1 and ADC123 Channel12 pins as analog inputs (DVM) ******************************/
  GPIO_InitStructure.GPIO_Pin = GPIO_Pin_1 | GPIO_Pin_2;
  GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AN;
  GPIO_InitStructure.GPIO_PuPd = GPIO_PuPd_NOPULL ;
  GPIO_Init(GPIOC, &GPIO_InitStructure);

